In [1]:
import pandas as pd

In [4]:
data = pd.read_csv("./prepro_data.csv")

In [7]:
data[['학력','전공','학점','토익','토스','오픽','자격증']]

         학력    전공           학점      토익         토스   오픽     자격증
0      서울4년    경제  학점 3.87/4.5     NaN        NaN  NaN     NaN
1      서울4년    경제  학점 3.87/4.5     NaN        NaN  NaN     NaN
2      서울4년    경제  학점 3.87/4.5     NaN        NaN  NaN     NaN
3      서울4년    경제  학점 3.87/4.5     NaN        NaN  NaN     NaN
4      서울4년    경제  학점 3.87/4.5     NaN        NaN  NaN     NaN
...     ...   ...          ...     ...        ...  ...     ...
25569  지방4년  기계공학   학점 3.6/4.5  토익 825  토스 level6  NaN     NaN
25570  지방4년  경영학부   학점 3.9/4.5  토익 845  토스 level6  NaN  자격증 4개
25571  지방4년  경영학부   학점 3.9/4.5  토익 845  토스 level6  NaN  자격증 4개
25572  지방4년  경영학부   학점 3.9/4.5  토익 845  토스 level6  NaN  자격증 4개
25573  지방4년  경영학부   학점 3.9/4.5  토익 845  토스 level6  NaN  자격증 4개

[25574 rows x 7 columns]

In [8]:
data[['해외경험','인턴','수상','동아리','교내활동','사회활동','자원봉사']]

          해외경험     인턴     수상  동아리 교내활동 사회활동     자원봉사
0          NaN    NaN    NaN  NaN  NaN  NaN      NaN
1          NaN    NaN    NaN  NaN  NaN  NaN      NaN
2          NaN    NaN    NaN  NaN  NaN  NaN      NaN
3          NaN    NaN    NaN  NaN  NaN  NaN      NaN
4          NaN    NaN    NaN  NaN  NaN  NaN      NaN
...        ...    ...    ...  ...  ...  ...      ...
25569  해외경험 2회    NaN  수상 2회  NaN  NaN  NaN  자원봉사 4회
25570      NaN  인턴 1회  수상 2회  NaN  NaN  NaN  자원봉사 1회
25571      NaN  인턴 1회  수상 2회  NaN  NaN  NaN  자원봉사 1회
25572      NaN  인턴 1회  수상 2회  NaN  NaN  NaN  자원봉사 1회
25573      NaN  인턴 1회  수상 2회  NaN  NaN  NaN  자원봉사 1회

[25574 rows x 7 columns]